---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinSummary
source: html/8148ca99-7145-7881-70f2-e5f932b44e4c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinSummary Property

"Summary"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinSummary { get; }
```